In [117]:
from google.cloud import bigquery
import pandas

In [118]:
client = bigquery.Client(location="US")
print("Client creating using default project: {}".format(client.project))

Client creating using default project: raffo-bq-xperiment

In [119]:
query = """
SELECT * FROM `bigquery-public-data.covid19_jhu_csse.deaths` 
where province_state is null and country_region = "United Kingdom" or country_region = "Italy"
"""

In [120]:
query_job = client.query(
    query,
    # Location must match that of the dataset(s) referenced in the query.
    location="US",
)  # API request - starts the query
df = query_job.to_dataframe()
df

,province_state,country_region,latitude,longitude,location_geom,_1_22_20,_1_23_20,_1_24_20,_1_25_20,_1_26_20,...,_3_22_20,_3_23_20,_3_24_20,_3_25_20,_3_26_20,_3_27_20,_3_28_20,_3_29_20,_3_30_20,_3_31_20
0,None,Italy,43.0000,12.000,POINT(12 43),0,0,0,0,0,...,5476,6077,6820,7503,8215,9134,10023,10779,11591,12428
1,None,United Kingdom,55.3781,-3.436,POINT(-3.436 55.3781),0,0,0,0,0,...,281,335,422,465,578,759,1019,1228,1408,1789

In [121]:
 df[list (('country_region',)) + list(df.columns[5:])]

,country_region,_1_22_20,_1_23_20,_1_24_20,_1_25_20,_1_26_20,_1_27_20,_1_28_20,_1_29_20,_1_30_20,...,_3_22_20,_3_23_20,_3_24_20,_3_25_20,_3_26_20,_3_27_20,_3_28_20,_3_29_20,_3_30_20,_3_31_20
0,Italy,0,0,0,0,0,0,0,0,0,...,5476,6077,6820,7503,8215,9134,10023,10779,11591,12428
1,United Kingdom,0,0,0,0,0,0,0,0,0,...,281,335,422,465,578,759,1019,1228,1408,1789

In [122]:
# importing pandas as pd 
import pandas as pd 
   
# dictionary of lists 
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"], 
        'degree': ["MBA", "BCA", "M.Tech", "MBA"], 
        'score':[90, 40, 80, 98]} 
  
# creating a dataframe from a dictionary  
df = pd.DataFrame(dict)

In [123]:
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [124]:
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [125]:
for i in df.itertuples(): 
    print(i)

Pandas(Index=0, name='aparna', degree='MBA', score=90)
Pandas(Index=1, name='pankaj', degree='BCA', score=40)
Pandas(Index=2, name='sudhir', degree='M.Tech', score=80)
Pandas(Index=3, name='Geeku', degree='MBA', score=98)

In [126]:
tuple(df.itertuples())[0]

Pandas(Index=0, name='aparna', degree='MBA', score=90)